org/main/20211007132712-log_machine.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-08 Mon 20:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Log Machine</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Linfeng  He" />
</head>
<body>
<div id="content">
<h1 class="title">Log Machine</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfbe7b68">1. Description</a></li>
<li><a href="#orge1015c2">2. methods</a>
<ul>
<li><a href="#org9e407ff">2.1. Journal.org</a></li>
<li><a href="#orgd66f81a">2.2. Tasks.org</a></li>
<li><a href="#org0777cdd">2.3. Detailed log</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
There are 2 kinds of log machine, dealing with 2 situations
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Doing bunch of small tasks</td>
<td class="org-left">Doing a scheduled big tasks</td>
</tr>

<tr>
<td class="org-left">Journal.org</td>
<td class="org-left">Tasks.org</td>
</tr>
</tbody>
</table>
<div id="outline-container-orgfbe7b68" class="outline-2">
<h2 id="orgfbe7b68"><span class="section-number-2">1.</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
Log machine takes in experiences, make them capable to reflect on.
it will be further checked by <a href="20211102235051-reflect_machine.html#ID-EAD2BDED-4AE1-4E91-BF44-24BAD882447A">Reflect Machine</a>, to generate <a href="20211005121901-principle.html#ID-E339CEF9-FCFA-414A-BC08-787F5C3039CF">principle</a>s to follow on the next run.
</p>

<p>
Similarly described in 
</p>
</div>
</div>
<div id="outline-container-orge1015c2" class="outline-2">
<h2 id="orge1015c2"><span class="section-number-2">2.</span> methods</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9e407ff" class="outline-3">
<h3 id="org9e407ff"><span class="section-number-3">2.1.</span> Journal.org</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>C-c c org-capture j j Journal entry
before the whole session start, open the Journal entry.
Timer will be automatically set
Could be put on Top left of screen</li>
<li>Record Deeds, Principles, and Outcome, in the entry</li>
</ol>
</div>
</div>

<div id="outline-container-orgd66f81a" class="outline-3">
<h3 id="orgd66f81a"><span class="section-number-3">2.2.</span> Tasks.org</h3>
</div>

<div id="outline-container-org0777cdd" class="outline-3">
<h3 id="org0777cdd"><span class="section-number-3">2.3.</span> Detailed log</h3>
<div class="outline-text-3" id="text-2-3">
<p>
in either method above.
Start a timer while clock in.
<code>C-c C-x i (clock-in)</code>
<code>C-c C-x 0 (timer-start)</code>
Create a timer item list to record realtime thoughts and doings.
<code>C-c C-x - (timer-item)</code>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Linfeng  He</p>
<p class="date">Created: 2021-11-08 Mon 20:54</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
