content/main/20211007132712-log_machine.md
+++
title = "Log Machine"
author = ["System Administrator"]
draft = false
+++

There are 2 kinds of log machine, dealing with 2 situations

| Doing bunch of small tasks | Doing a scheduled big tasks |
|----------------------------|-----------------------------|
| Journal.org                | Tasks.org                   |


## Description {#description}

Log machine takes in experiences, make them capable to reflect on.
it will be further checked by [Reflect Machine]({{< relref "20211102235051-reflect_machine.md" >}}), to generate [principle]({{< relref "20211005121901-principle.md" >}})s to follow on the next run.

Similarly described in


## methods {#methods}


### Journal.org {#journal-dot-org}

1.  C-c c org-capture j j Journal entry
    before the whole session start, open the Journal entry.
    Timer will be automatically set
    Could be put on Top left of screen
2.  Record Deeds, Principles, and Outcome, in the entry


### Tasks.org {#tasks-dot-org}


### Detailed log {#detailed-log}

in either method above.
Start a timer while clock in.
`C-c C-x i (clock-in)`
`C-c C-x 0 (timer-start)`
Create a timer item list to record realtime thoughts and doings.
`C-c C-x - (timer-item)`